In [1]:
import numpy as np

In [2]:
import pandas as pd

In [15]:
people1={'id':['1','2','3'],
         'name':['oggy','hattori','nobita'],
          'age':['3','56','67'],
                 }

In [16]:
df=pd.DataFrame(people1)

In [17]:
df

  id     name age
0  1     oggy   3
1  2  hattori  56
2  3   nobita  67

In [25]:
d1=pd.read_csv('naam.csv')

In [26]:
d1

        name  age   roll
0    'akash'   23  456.0
1     'raju'   46  463.0
2  'bhola'23  232    NaN

In [28]:
d2=pd.read_csv('name.tsv')

In [29]:
d2

      name          age               roll
0     'akash'         23               456
1    'raju '          46               463
2   'bhola'          23                232

# Creating Json file

In [31]:
d1

        name  age   roll
0    'akash'   23  456.0
1     'raju'   46  463.0
2  'bhola'23  232    NaN

In [32]:
d1.to_json('myjson.json')

In [33]:
d2=pd.read_json('myjson.json')

In [34]:
d2

        name  age   roll
0    'akash'   23  456.0
1     'raju'   46  463.0
2  'bhola'23  232    NaN

In [35]:
d2.to_csv('hicsv.csv')

In [36]:
d2

        name  age   roll
0    'akash'   23  456.0
1     'raju'   46  463.0
2  'bhola'23  232    NaN